In [31]:
import pandas as pd

In [32]:
# generate the dummy data
data = {"john":[98,87,87,88,96],
        "Adam":[88,52,69,79,79],
        "David":[90,92,71,60,92]}
df = pd.DataFrame(data)

In [33]:
df.head()

   john  Adam  David
0    98    88     90
1    87    52     92
2    87    69     71
3    88    79     60
4    96    79     92

In [42]:
df.median()

john     88.0
Adam     79.0
David    90.0
dtype: float64

In [34]:
df.mode() #returns most frequently element

   john  Adam  David
0    87    79     92

In [35]:
df.mean() # mean of data

john     91.2
Adam     73.4
David    81.0
dtype: float64

In [36]:
df.var() # gives us sample varriance

john      28.7
Adam     188.3
David    216.0
dtype: float64

In [37]:
df.var(ddof=0)#population variance

john      22.96
Adam     150.64
David    172.80
dtype: float64

In [38]:
df.std(ddof=0)#population standard deviation

john      4.791659
Adam     12.273549
David    13.145341
dtype: float64

In [39]:
df.std() #sample standard deviation

john      5.357238
Adam     13.722245
David    14.696938
dtype: float64

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   john    5 non-null      int64
 1   Adam    5 non-null      int64
 2   David   5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [46]:
df.quantile(0.25)

john     87.0
Adam     69.0
David    71.0
Name: 0.25, dtype: float64

In [47]:
df.quantile(0.75)

john     96.0
Adam     79.0
David    92.0
Name: 0.75, dtype: float64

In [48]:
df.quantile(1.0)

john     98.0
Adam     88.0
David    92.0
Name: 1.0, dtype: float64

In [50]:
iqr = df.quantile(0.75)-df.quantile(0.25)
iqr

john      9.0
Adam     10.0
David    21.0
dtype: float64

In [41]:
df.describe()

            john       Adam      David
count   5.000000   5.000000   5.000000
mean   91.200000  73.400000  81.000000
std     5.357238  13.722245  14.696938
min    87.000000  52.000000  60.000000
25%    87.000000  69.000000  71.000000
50%    88.000000  79.000000  90.000000
75%    96.000000  79.000000  92.000000
max    98.000000  88.000000  92.000000

In [51]:
df.max()

john     98
Adam     88
David    92
dtype: int64

In [53]:
range = df.max()-df.min()
range

john     11
Adam     36
David    32
dtype: int64